<a href="https://colab.research.google.com/github/roshanappa/Time-Series-Analysis-/blob/master/Time_Series_Feature_Engineering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:
from zipfile import ZipFile

In [4]:
with ZipFile('/content/64789_128364_bundle_archive.zip',mode='r') as zip:
  zip.extractall()
  print('Done')

Done

In [131]:
birth_data = pd.read_csv('/content/daily-total-female-births-CA.csv',parse_dates=True,squeeze=True)

In [132]:
birth_data.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [133]:
birth_data.isnull().sum()

date      0
births    0
dtype: int64

In [134]:
birth_data.tail()

           date  births
360  1959-12-27      37
361  1959-12-28      52
362  1959-12-29      48
363  1959-12-30      55
364  1959-12-31      50

In [135]:
birth_data['lag1'] = birth_data['births'].shift(1)
birth_data['lag2']=birth_data['births'].shift(2)
birth_data['lag3']=birth_data['births'].shift(3)

In [136]:
birth_data.head(10)

         date  births  lag1  lag2  lag3
0  1959-01-01      35   NaN   NaN   NaN
1  1959-01-02      32  35.0   NaN   NaN
2  1959-01-03      30  32.0  35.0   NaN
3  1959-01-04      31  30.0  32.0  35.0
4  1959-01-05      44  31.0  30.0  32.0
5  1959-01-06      29  44.0  31.0  30.0
6  1959-01-07      45  29.0  44.0  31.0
7  1959-01-08      43  45.0  29.0  44.0
8  1959-01-09      38  43.0  45.0  29.0
9  1959-01-10      27  38.0  43.0  45.0

# Apply the MA (Moving Average)

In [137]:
birth_data['MA3'] = birth_data['births'].rolling(window=3).mean()
birth_data['MA4'] = birth_data['births'].rolling(window=4).mean()
birth_data['MA5'] = birth_data['births'].rolling(window=5).mean()

In [138]:
birth_data.head(7)

         date  births  lag1  lag2  lag3        MA3    MA4   MA5
0  1959-01-01      35   NaN   NaN   NaN        NaN    NaN   NaN
1  1959-01-02      32  35.0   NaN   NaN        NaN    NaN   NaN
2  1959-01-03      30  32.0  35.0   NaN  32.333333    NaN   NaN
3  1959-01-04      31  30.0  32.0  35.0  31.000000  32.00   NaN
4  1959-01-05      44  31.0  30.0  32.0  35.000000  34.25  34.4
5  1959-01-06      29  44.0  31.0  30.0  34.666667  33.50  33.2
6  1959-01-07      45  29.0  44.0  31.0  39.333333  37.25  35.8

One we are notice over here that the Null values are getting increase when we increase Moving avarage window.

If any subject expert told that we wanted the highest value becasue it true relecting on the busiiness.

In this case,we will do the max instead of mean.

In such cases we having an open options those are the standard deviation,median,variance etc.

In [139]:
birth_data['MAX_5'] = birth_data['births'].rolling(window=5).max()
#as per the subject experty recoomandation we got the max value of the birth at the at the every 5th day.

In [140]:
birth_data.head(10)

         date  births  lag1  lag2  lag3        MA3    MA4   MA5  MAX_5
0  1959-01-01      35   NaN   NaN   NaN        NaN    NaN   NaN    NaN
1  1959-01-02      32  35.0   NaN   NaN        NaN    NaN   NaN    NaN
2  1959-01-03      30  32.0  35.0   NaN  32.333333    NaN   NaN    NaN
3  1959-01-04      31  30.0  32.0  35.0  31.000000  32.00   NaN    NaN
4  1959-01-05      44  31.0  30.0  32.0  35.000000  34.25  34.4   44.0
5  1959-01-06      29  44.0  31.0  30.0  34.666667  33.50  33.2   44.0
6  1959-01-07      45  29.0  44.0  31.0  39.333333  37.25  35.8   45.0
7  1959-01-08      43  45.0  29.0  44.0  39.000000  40.25  38.4   45.0
8  1959-01-09      38  43.0  45.0  29.0  42.000000  38.75  39.8   45.0
9  1959-01-10      27  38.0  43.0  45.0  36.000000  38.25  36.4   45.0

In [141]:
birth_data['MIN_5'] = birth_data['births'].rolling(window=5).min()
#When the min value is required according to bussiness requirement we have taken the minimum value in the duration of 5 days.

In [142]:
birth_data['date'] = pd.to_datetime(birth_data['date'])

In [143]:
birth_data.head()

        date  births  lag1  lag2  lag3        MA3    MA4   MA5  MAX_5  MIN_5
0 1959-01-01      35   NaN   NaN   NaN        NaN    NaN   NaN    NaN    NaN
1 1959-01-02      32  35.0   NaN   NaN        NaN    NaN   NaN    NaN    NaN
2 1959-01-03      30  32.0  35.0   NaN  32.333333    NaN   NaN    NaN    NaN
3 1959-01-04      31  30.0  32.0  35.0  31.000000  32.00   NaN    NaN    NaN
4 1959-01-05      44  31.0  30.0  32.0  35.000000  34.25  34.4   44.0   30.0

In [144]:
birth_data.set_index(birth_data['date'],inplace=True,drop=True)

In [146]:
birth_data.drop(columns=['date'],inplace=True)

In [147]:
birth_data.head()

            births  lag1  lag2  lag3        MA3    MA4   MA5  MAX_5  MIN_5
date
1959-01-01      35   NaN   NaN   NaN        NaN    NaN   NaN    NaN    NaN
1959-01-02      32  35.0   NaN   NaN        NaN    NaN   NaN    NaN    NaN
1959-01-03      30  32.0  35.0   NaN  32.333333    NaN   NaN    NaN    NaN
1959-01-04      31  30.0  32.0  35.0  31.000000  32.00   NaN    NaN    NaN
1959-01-05      44  31.0  30.0  32.0  35.000000  34.25  34.4   44.0   30.0

In [148]:
birth_data['day'] = birth_data.index.day

In [149]:
birth_data['year'] = birth_data.index.year

In [150]:
birth_data['month'] = birth_data.index.month

In [151]:
birth_data.head()

            births  lag1  lag2  lag3        MA3  ...  MAX_5  MIN_5  day  year  month
date                                             ...
1959-01-01      35   NaN   NaN   NaN        NaN  ...    NaN    NaN    1  1959      1
1959-01-02      32  35.0   NaN   NaN        NaN  ...    NaN    NaN    2  1959      1
1959-01-03      30  32.0  35.0   NaN  32.333333  ...    NaN    NaN    3  1959      1
1959-01-04      31  30.0  32.0  35.0  31.000000  ...    NaN    NaN    4  1959      1
1959-01-05      44  31.0  30.0  32.0  35.000000  ...   44.0   30.0    5  1959      1

[5 rows x 12 columns]

In [ ]:
birth_data.dropna()

# Diffrencing 
In order to make the dataframe time series in the form of Stationary so that data will not be the show any seasonality,trend and cyclic thing in time series.